{
    "ocr": {
        "title": "end-to-end OCR model",
        "type": "CS",
        "link": "",
        "media": [{
            "type": "image",
            "url": "CS/e2e.jpg"
        }],
        "description": [{
            "type": "text",
            "content": "I developed and tested a model that recognizes scene text of arbitrary shapes by combining ABC-Net and Transformer architectures during my research internship at Lomin, an OCR company in Korea."
        }],
        "date": "2101",
        "tools": "PyTorch, Linux (Docker)"
    },
    "geolocation": {
        "title": "image geolocation",
        "type": "CS",
        "link": "",
        "media": [{
            "type": "image",
            "url": "CS/geolocation.png"
        }],
        "description": [{
            "type": "text",
            "content": "I constructed a solution for image geolocation given a drone-shot scene image of a Korean street or landscape. I implemented text-filtering algorithms to post-process outputs of STR models, utilized Google, Naver, and Kakao Map APIs for geocoding and generating test data, and used OpenCV to analyze map images and localize geographical coordinates."
        }],
        "date": "2011",
        "tools": "Python (OpenCV), Javascript"
    },
    "plugin": {
        "title": "accessible web browser plugin",
        "type": "CS",
        "link": "",
        "media": [{
            "type": "image",
            "url": "CS/plugin.png"
        }],
        "description": [{
            "type": "text",
            "content": "For my junior year independent work project, I collaborated with a classmate to create a Chrome browser extension that detects and highlights web page elements that are inaccessible to users with visual and audio impairment, as outlined by the ADA Website Compliance Guidelines. When run on any website, the extension outlines the problematic portion of the website, as well as lists an explanation of why it can be inaccessible to certain users, and how it can be fixed. This is a useful tool especially for developers who want to test if their code is accessible before publishing a website."
        }],
        "date": "2005",
        "tools": "Javascript"
    },
    "tokitalk": {
        "title": "tokitalk",
        "type": "CS",
        "link": "",
        "media": [{
            "type": "image",
            "url": "CS/tokitalk.png"
        }],
        "description": [{
                "type": "text",
                "content": "In the summer following my sophomore year of college, I interned at Hancom Robotics, which is a company based in Korea that specializes in making robots for various purposes. The robot I worked with most closely during my time was, \"Toki,\" a child-sized robot that is used in households and schools to practice English with students through dialogues, quizzes, and storybook telling. When practicing an English dialogue, Toki puts on these glasses and asks a question and displays it on the left lens, and waits for the student to respond while displaying the correct answer on the right lens. "
            },
            {
                "type": "text",
                "content": "Toki comes with an English curriculum that consists of pre-determined dialogues that students can practice with, but it also allows teachers to create their own additional dialogues and quizzes and send them to the server. I created an application using Spring Web MVC that provides an interface for teachers to upload the Excel files they create, and send them over to Toki so students can practice with customized dialogues. When the custom file is uploaded, the server parses all of the information and formats the dialogues so the text can be displayed on the robot's interface, the appropriate sound effects are played, and the lines cycle through for students to practice."
            }

        ],
        "date": "1908",
        "tools": "Spring MVC, MySQL"
    },
    "toki-bluetooth-app": {
        "title": "toki bluetooth app",
        "type": "CS",
        "link": "",
        "media": [{
                "type": "image",
                "url": "CS/bluetooth.jpg"
            },
            {
                "type": "image",
                "url": "CS/bluetooth.jpg"
            }
        ],
        "description": [{
                "type": "text",
                "content": "Toki is an educational robot developed by Hancom Robotics, where I interned the summer after my sophomore year. It teaches English to pre - school and elementary school students through verbal dialogue exchanges and quizzes. It is used at home for daily conversation practice, as well as in schools and English academies."
            },
            {
                "type": "text",
                "content": "A frustrating problem that we encountered when testing Toki at various academies was that in classroom environments where there were numerous students conversing with each other at once, Toki often had a difficult time discerning the voice of the student that it was speaking with. After much contemplation and discussion, we eventually decided to create an application that activates Toki's built-in bluetooth capabilities, and allows Toki to connect with a bluetooth headset so that students can speak into a microphone. This allowed Toki to pick up the individual students' voices better, and also help students hear Toki more clearly when there is a lot of background noise."
            },

            {
                "type": "text",
                "content": "I utilized Android Studio to develop a bluetooth application for the robot that has the following features:"
            },
            {
                "type": "text",
                "content": "1. Turn bluetooth functionality on and off"
            },
            {
                "type": "text",
                "content": "2. Make Toki discoverable to nearby bluetooth devices"
            },
            {
                "type": "text",
                "content": "3. Display all nearby bluetooth headsets"
            },
            {
                "type": "text",
                "content": "4. Display all paired devices"
            },
            {
                "type": "text",
                "content": "5. Allow the user to pair and connect to nearby devices"
            },
            {
                "type": "text",
                "content": "6. Allow the user to connect to already paired devices"
            },
            {
                "type": "text",
                "content": "7. Disconnect with devices"
            },
            {
                "type": "text",
                "content": "8. Unpair from devices"
            }
        ],
        "date": "1906",
        "tools": "Android Studio"
    },
    "tigerride": {
        "title": "tigerride",
        "type": "CS",
        "link": "",
        "media": [{
            "type": "image",
            "url": "CS/tigerride.png"
        }],
        "description": [{
                "type": "text",
                "content": "With a group of friends, I created Tigerride, a web application that streamlines the process of students sharing rideshare services to and from campus in order minimize travel costs and search time."
            },
            {
                "type": "text",
                "content": "At the beginning and end of every break, numerous Princeton students look for people to split Uber/Lyft rides with to nearby airports, because the costs are quite expensive. Tigerride matches people who are looking to travel from the same origin to the same destination around the same time frame. I was primarily in charge of the front-end development for this project."
            }
        ],
        "date": "1905",
        "tools": "Django, Postgres, Heroku"
    },
    "alpaca": {
        "title": "alpaca game",
        "type": "CS",
        "link": "",
        "media": [{
                "type": "image",
                "url": "CS/alpaca0.png"
            },
            {
                "type": "image",
                "url": "CS/alpaca1.png"
            }
        ],
        "description": [{
                "type": "text",
                "content": "I created a game in Unity in which the user becomes an alpaca and travels the world to learn about different gender identities and sexualities that are specific to certain cultures."
            },
            {
                "type": "text",
                "content": "<a href=\"./alpaca.html\" target=\"_blank\" rel=\"noopener noreferrer\">Learn more</a>"
            }
        ],
        "date": "2112",
        "tools": "Unity, Autodesk Maya"
    },
    "rhythm-cooker": {
        "title": "rhythm cooker",
        "type": "CS",
        "link": "https://christinekwon.github.io/rhythm-cooker/",
        "media": [{
            "type": "image",
            "url": "CS/rhythm.png"
        }],
        "description": [{
            "type": "text",
            "content": "I created a program that generates a combination of random rhythms and chords. The user can customize the keys, tempos, instruments, lengths, octave ranges, and time signatures of the outcome."
        }],
        "date": "2103",
        "tools": "Javascript (node.js, tone.js, timbre.js), HTML, CSS"
    }
}